tap "apprisshealth/platform", "https://stash.sdlc.appriss.com/scm/hciauto/homebrew.git"
tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/portable-ruby"
tap "homebrew/services"
cask "osxfuse"
cask "xquartz"
brew "ack"
brew "aspell"
brew "bash"
brew "bash-completion@2"
brew "bmake"
brew "brew-cask-completion"
brew "bundler-completion"
brew "checkbashisms"
brew "cloc"
brew "coreutils"
brew "ctags"
brew "curlftpfs"
brew "direnv"
brew "dos2unix"
brew "editorconfig"
brew "exa"
brew "fd"
brew "findutils"
brew "fzf"
brew "gawk"
brew "gem-completion"
brew "git"
brew "git-extras"
brew "git-hooks"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg"
brew "gradle"
brew "htop"
brew "hub"
brew "jq"
brew "kubernetes-cli"
brew "impostor2"
brew "iproute2mac"
brew "kubectx"
brew "lastpass-cli"
brew "lftp"
brew "lighttpd"
brew "macvim", link: false
brew "mas"
brew "maven"
brew "maven-completion"
brew "moreutils"
brew "most"
brew "neovim"
brew "node"
brew "nvm"
brew "open-completion"
brew "p7zip"
brew "pip-completion"
brew "postgresql@9.6", restart_service: true
brew "prettier"
brew "rails-completion"
brew "rake-completion"
brew "rbenv"
brew "redis", restart_service: true
brew "redshift"
brew "ripgrep"
brew "ruby-completion"
brew "sonarqube"
brew "the_silver_searcher"
brew "tig"
brew "tree"
brew "vault"
brew "wget"
brew "wifi-password"
brew "wireguard-tools"
brew "yarn"
brew "yarn-completion"
cask "adoptopenjdk8"
cask "amazon-workspaces"
cask "android-file-transfer"
cask "appcleaner"
cask "caffeine"
cask "dbeaver-community"
cask "docker"
cask "dotnet-sdk"
cask "eclipse-java"
cask "emacs"
cask "firefox"
cask "flux"
cask "foreman"
cask "google-backup-and-sync"
cask "intellij-idea"
cask "iterm2"
cask "java11"
cask "kindle"
cask "logitech-control-center"
cask "logitech-options"
cask "mactex"
cask "macvim"
cask "mcedit"
cask "moom"
cask "p4v"
cask "pdftotext"
cask "pgadmin4"
cask "phantomjs"
cask "postman"
cask "roblox"
cask "rubymine"
cask "send-to-kindle"
cask "sloth"
cask "soapui"
cask "springtoolsuite"
cask "sqlitestudio"
cask "the-unarchiver"
cask "unetbootin"
cask "vimr"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio-code"
mas "Amphetamine", id: 937984704
mas "Go for Gmail", id: 979538493
mas "LastPass", id: 926036361
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
