tap "adoptopenjdk/openjdk"
tap "buo/cask-upgrade"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/portable-ruby"
tap "homebrew/services"
# Search tool like grep, but optimized for programmers
brew "ack"
# Spell checker with better logic than ispell
brew "aspell"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Portable version of NetBSD make(1)
brew "bmake"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Arbitrary precision calculator
brew "calc"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Emacs dependency management
brew "cask"
# Checks for bashisms in shell scripts
brew "checkbashisms"
# Statistics utility to count lines of code
brew "cloc"
# Diff your Docker containers
brew "container-diff"
# Reimplementation of ctags(1)
brew "ctags"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr", link: false
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Lightweight scripting language for querying databases
brew "flux"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Manage project, user, and global Git hooks
brew "git-hooks"
# Git extension for versioning large files
brew "git-lfs"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Improved top (interactive process viewer)
brew "htop"
# CLI wrapper for basic network utilities on macOS - ip command
brew "iproute2mac"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# LastPass command-line interface tool
brew "lastpass-cli"
# Sophisticated file transfer program
brew "lftp"
# Small memory footprint, flexible web-server
brew "lighttpd"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Powerful paging program
brew "most"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Command-line collection runner for Postman
brew "newman"
# Platform built on V8 to build network applications
brew "node@14"
# Bash completion for open
brew "open-completion"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Convert PDFs to images
brew "pdf2image"
# Object-relational database system
brew "postgresql@9.6"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Generic syntax highlighter
brew "pygments"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Secures, stores, and tightly controls access to secrets
brew "vault"
# Vi 'workalike' with many additional features
brew "vim", link: false
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Consul
brew "hashicorp/tap/consul"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk11"
# AdoptOpenJDK OpenJDK (Java) Development Kit
cask "adoptopenjdk16"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Application uninstaller
cask "appcleaner"
# Web browser focusing on privacy
cask "brave-browser"
# Utility that prevents the system from going to sleep
cask "caffeine"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Screen color temperature controller
cask "flux"
cask "font-hack-nerd-font"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Interface for reading and syncing eBooks
cask "kindle"
# Enhances Gmail like a full-featured desktop office productivity app
cask "kiwi-for-gmail"
# Provides access to camera controls
cask "logitech-camera-settings"
# Software for Logitech devices
cask "logitech-options"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Text editor
cask "macvim"
# Minecraft world editor
cask "mcedit"
# Utility to move and zoom windows—on one display
cask "moom"
# Minecraft launcher
cask "multimc"
# Visual client for Helix Core
cask "p4v"
# Collaboration platform for API development
cask "postman"
# Tool for sending personal documents to Kindles from Macs
cask "send-to-kindle"
# Create, edit, browse SQLite databases
cask "sqlitestudio"
# Unpacks archive files
cask "the-unarchiver"
# Tool to install Linux/BSD distributions to a partition or USB drive
cask "unetbootin"
# Open-source code editor
cask "visual-studio-code"
# Open-source version of the X.Org X Window System
cask "xquartz"
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LastPass", id: 926036361
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
